<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of InVision Studio.</string>
	<key>Identifier</key>
	<string>adrienlabigne.download.InVisionStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>InVision Studio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://trapezoid-prod.s3.amazonaws.com/releases/builds/1.28.2/official/mac/InVision%20Studio-1.28.2.dmg?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAJ4FGZNZJJINNP3FA%2F20210225%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Date=20210225T133809Z&amp;X-Amz-Expires=2700&amp;X-Amz-SignedHeaders=host&amp;X-Amz-Signature=fc39bbb8d40a553ad49f81ff583071946cd6572648ae487ef3c2130419a91032</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/InVision Studio.app</string>
				<key>requirement</key>
				<string>identifier "invision.invision-studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VRXQSNCL5W</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/InVision Studio.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
